# SectionProperty Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
SpecTypeId..::..SectionProperty Property
SpecTypeId Class See Also
---
Section Property, in discipline Structural.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2021
# Syntax
C#
---
```text
public static ForgeTypeId SectionProperty { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property SectionProperty As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ SectionProperty {
	ForgeTypeId^ get ();
}
```

# See Also
SpecTypeId Class
Autodesk.Revit.DB Namespace